bagdades/stm32solderstation_st7735/Drivers/graphics/st7735.c
static void ST7735_ExecuteCommandList(const uint8_t *addr) {
    uint8_t numCommands, numArgs;
    uint16_t ms;

    numCommands = *addr++;
    while(numCommands--) {
        uint8_t cmd = *addr++;
        ST7735_WriteCommand(cmd);

        numArgs = *addr++;
        // If high bit set, delay follows args
        ms = numArgs & DELAY;
        numArgs &= ~DELAY;
        if(numArgs) {
            ST7735_WriteData((uint8_t*)addr, numArgs);
            addr += numArgs;
        }

        if(ms) {
            ms = *addr++;
            if(ms == 255) ms = 500;
            HAL_Delay(ms);
        }
    }
}

static void ST7735_SetAddressWindow(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1) {
    // column address set
    ST7735_WriteCommand(ST7735_CASET);
    uint8_t data[] = { 0x00, x0 + ST7735_XSTART, 0x00, x1 + ST7735_XSTART };
    ST7735_WriteData(data, sizeof(data));

    // row address set
    ST7735_WriteCommand(ST7735_RASET);
    data[1] = y0 + ST7735_YSTART;
    data[3] = y1 + ST7735_YSTART;
    ST7735_WriteData(data, sizeof(data));

    // write to RAM
    ST7735_WriteCommand(ST7735_RAMWR);
}

void ucg_Init() {
	LCD_SPI_HAND->CR1 |= SPI_CR1_SPE;
    ST7735_Select();
    ST7735_Reset();
    ST7735_ExecuteCommandList(init_cmds1);
    ST7735_ExecuteCommandList(init_cmds2);
    ST7735_ExecuteCommandList(init_cmds3);
    ST7735_Unselect();
}

void ucg_DrawPixel(ucg_t* ucg, uint16_t x, uint16_t y) {
    if((x >= ST7735_WIDTH) || (y >= ST7735_HEIGHT))
        return;

    ST7735_Select();

    ST7735_SetAddressWindow(x, y, x+1, y+1);
    uint8_t data[] = { ucg->forecolor >> 8, ucg->forecolor & 0xFF };
    ST7735_WriteData(data, sizeof(data));

    ST7735_Unselect();
}
static void ST7735_WriteChar(uint16_t x, uint16_t y, char ch, const tFont* font, uint16_t color, uint16_t bgcolor) {
    uint32_t i, b, j;
    uint8_t chr;
    uint8_t n, m;
    n = m = 0;

    chr = ch - font->chars[0].code;
    /* if(!chr) return; */
    ST7735_SetAddressWindow(x, y, x+font->chars[chr].image->width - 1, y+font->chars[chr].image->height - 1);

    b = font->chars[chr].image->data[m++];
    for(i = 0; i < font->chars[chr].image->height; i++) {
        /* n = 0; */
        for(j = 0; j < font->chars[chr].image->width; j++) {
            if(b & 0x8000)  {
                uint8_t data[] = { color >> 8, color & 0xFF };
                ST7735_WriteData(data, sizeof(data));
            } else {
                uint8_t data[] = { bgcolor >> 8, bgcolor & 0xFF };
                ST7735_WriteData(data, sizeof(data));
            }
            n++;
            b = b << 1;
            if(n == 16) {
                n = 0;
                b = font->chars[chr].image->data[m++];
            }
        }
    }
}

/* static void ST7735_WriteChar(uint16_t x, uint16_t y, char ch, FontDef* font, uint16_t color, uint16_t bgcolor) { */
/*     uint32_t i, b, j; */
/*  */
/*     ST7735_SetAddressWindow(x, y, x+font->width-1, y+font->height-1); */
/*  */
/*     if(font->width > 16) { */
/*         for(i = 0; i < font->height * 2; i++) { */
/*             b = font->data[(ch - 32) * 70 + i]; */
/*             for(j = 0; j < 16; j++) { */
/*                 if((b << j) & 0x8000)  { */
/*                     uint8_t data[] = { color >> 8, color & 0xFF }; */
/*                     ST7735_WriteData(data, sizeof(data)); */
/*                 } else { */
/*                     uint8_t data[] = { bgcolor >> 8, bgcolor & 0xFF }; */
/*                     ST7735_WriteData(data, sizeof(data)); */
/*                 } */
/*             } */
/*             i++; */
/*             b = font->data[(ch - 32) * 70 + i]; */
/*             for(j = 0; j < 10; j++) { */
/*                 if((b << j) & 0x8000)  { */
/*                     uint8_t data[] = { color >> 8, color & 0xFF }; */
/*                     ST7735_WriteData(data, sizeof(data)); */
/*                 } else { */
/*                     uint8_t data[] = { bgcolor >> 8, bgcolor & 0xFF }; */
/*                     ST7735_WriteData(data, sizeof(data)); */
/*                 } */
/*             } */
/*         } */
/*     } */
/*         else { */
/*             for(i = 0; i < font->height; i++) { */
/*                 b = font->data[(ch - 32) * font->height + i]; */
/*                 for(j = 0; j < font->width; j++) { */
/*                     if((b << j) & 0x8000)  { */
/*                         uint8_t data[] = { color >> 8, color & 0xFF }; */
/*                         ST7735_WriteData(data, sizeof(data)); */
/*                     } else { */
/*                         uint8_t data[] = { bgcolor >> 8, bgcolor & 0xFF }; */
/*                         ST7735_WriteData(data, sizeof(data)); */
/*                     } */
/*                 } */
/*             } */
/*         } */
/* } */

/*
Simpler (and probably slower) implementation:

static void ST7735_WriteChar(uint16_t x, uint16_t y, char ch, FontDef font, uint16_t color) {
    uint32_t i, b, j;

    for(i = 0; i < font.height; i++) {
        b = font.data[(ch - 32) * font.height + i];
        for(j = 0; j < font.width; j++) {
            if((b << j) & 0x8000)  {
                ST7735_DrawPixel(x + j, y + i, color);
            } 
        }
    }
}
*/

void ucg_WriteString(ucg_t* ucg, uint16_t x, uint16_t y, const char* str) {
    ST7735_Select();
    uint8_t chr;

    while(*str) {
        if(*str == '\n' || *str == '\r'){
            y = y + ucg->font->chars[0].image->height + 2;
            if((y + ucg->font->chars[0].image->height + 2) >= ST7735_HEIGHT)
                y = 0;
            x = 0;
            str++;
        }
        chr = *str - ucg->font->chars[0].code;
        if(x + ucg->font->chars[chr].image->width >= ST7735_WIDTH) {
            x = 0;
            y += ucg->font->chars[chr].image->height;
            if(y + ucg->font->chars[chr].image->height >= ST7735_HEIGHT) {
                break;
            }

            if(*str == ' ') {
                // skip spaces in the beginning of the new line
                str++;
                continue;
            }
        }

