bagdades/stm32solderstation_st7735/Drivers/graphics/st7735.c
        ST7735_WriteChar(x, y, *str, ucg->font, ucg->forecolor, ucg->backcolor);
        x += ucg->font->chars[chr].image->width;
        str++;
    }

    ST7735_Unselect();
}

/* void ucg_WriteString(ucg_t* ucg, uint16_t x, uint16_t y, const char* str) { */
/*     ST7735_Select(); */
/*  */
/*     while(*str) { */
/*         if(x + ucg->font->width >= ST7735_WIDTH) { */
/*             x = 0; */
/*             y += ucg->font->height; */
/*             if(y + ucg->font->height >= ST7735_HEIGHT) { */
/*                 break; */
/*             } */
/*  */
/*             if(*str == ' ') { */
/*                 // skip spaces in the beginning of the new line */
/*                 str++; */
/*                 continue; */
/*             } */
/*         } */
/*  */
/*         ST7735_WriteChar(x, y, *str, ucg->font, ucg->forecolor, ucg->backcolor); */
/*         x += ucg->font->width; */
/*         str++; */
/*     } */
/*  */
/*     ST7735_Unselect(); */
/* } */

void ucg_FillCircle(ucg_t* ucg, int16_t x0, int16_t y0, int16_t r) {
   int16_t  x,y,xd;

   if ( x0<0 ) return;
   if ( y0<0 ) return;
   if ( r<=0 ) return;

   xd = 3 - (r << 1);
   x = 0;
   y = r;

   while ( x <= y )
   {
     if( y > 0 )
     {
        ucg_DrawLine(ucg, x0 - x, y0 - y,x0 - x, y0 + y);
        ucg_DrawLine(ucg, x0 + x, y0 - y,x0 + x, y0 + y);
     }
     if( x > 0 )
     {
        ucg_DrawLine(ucg, x0 - y, y0 - x,x0 - y, y0 + x);
        ucg_DrawLine(ucg, x0 + y, y0 - x,x0 + y, y0 + x);
     }
     if ( xd < 0 )
     {
        xd += (x << 2) + 6;
     }
     else
     {
        xd += ((x - y) << 2) + 10;
        y--;
     }
     x++;
   }
   ucg_DrawCircle(ucg, x0, y0, r);
}

void ucg_FillFrame(ucg_t* ucg, int16_t x1, int16_t y1, int16_t x2, int16_t y2) {
   int16_t n,m;

   if ( x2 < x1 )
   {
      n = x2;
      x2 = x1;
      x1 = n;
   }
   if ( y2 < y1 )
   {
      n = y2;
      y2 = y1;
      y1 = n;
   }

   for( m=y1; m<=y2; m++ )
   {
      for( n=x1; n<=x2; n++ )
      {
         ucg_DrawPixel(ucg, n, m);
      }
   }
}

void ucg_FillRoundFrame(ucg_t* ucg, int16_t x1, int16_t y1, int16_t x2, int16_t y2, int16_t r) {
   int16_t  x,y,xd;

   if ( x2 < x1 )
   {
      x = x2;
      x2 = x1;
      x1 = x;
   }
   if ( y2 < y1 )
   {
      y = y2;
      y2 = y1;
      y1 = y;
   }

   if ( r<=0 ) return;

   xd = 3 - (r << 1);
   x = 0;
   y = r;

   ucg_FillFrame(ucg, x1 + r, y1, x2 - r, y2);

   while ( x <= y )
   {
     if( y > 0 )
     {
        ucg_DrawLine(ucg, x2 + x - r, y1 - y + r, x2+ x - r, y + y2 - r);
        ucg_DrawLine(ucg, x1 - x + r, y1 - y + r, x1- x + r, y + y2 - r);
     }
     if( x > 0 )
     {
        ucg_DrawLine(ucg, x1 - y + r, y1 - x + r, x1 - y + r, x + y2 - r);
        ucg_DrawLine(ucg, x2 + y - r, y1 - x + r, x2 + y - r, x + y2 - r);
     }
     if ( xd < 0 )
     {
        xd += (x << 2) + 6;
     }
     else
     {
        xd += ((x - y) << 2) + 10;
        y--;
     }
     x++;
   }
}

void ucg_FillRectangle(ucg_t* ucg, uint16_t x, uint16_t y, uint16_t w, uint16_t h) {
    // clipping
    if((x >= ST7735_WIDTH) || (y >= ST7735_HEIGHT)) return;
    if((x + w - 1) >= ST7735_WIDTH) w = ST7735_WIDTH - x;
    if((y + h - 1) >= ST7735_HEIGHT) h = ST7735_HEIGHT - y;

    ST7735_Select();
    ST7735_SetAddressWindow(x, y, x+w-1, y+h-1);

    uint8_t data[] = { ucg->forecolor >> 8, ucg->forecolor & 0xFF };
    HAL_GPIO_WritePin(LCD_DC_GPIO_Port, LCD_DC_Pin, GPIO_PIN_SET);
    for(y = h; y > 0; y--) {
        for(x = w; x > 0; x--) {
            /* HAL_SPI_Transmit(&ST7735_SPI_PORT, data, sizeof(data), HAL_MAX_DELAY); */
            ST7735_SendByte(data[0]);
            ST7735_SendByte(data[1]);
        }
    }

    ST7735_Unselect();
}

void ucg_FillScreen(ucg_t* ucg) {
    ucg_FillRectangle(ucg, 0, 0, ST7735_WIDTH, ST7735_HEIGHT);
}

void ucg_DrawRectangle(ucg_t* ucg, uint8_t x, uint8_t y, uint8_t w, uint8_t h) {
    if((x >= ST7735_WIDTH) || (y >= ST7735_HEIGHT)) return;
    if((x + w - 1) >= ST7735_WIDTH) w = ST7735_WIDTH - x;
    if((y + h - 1) >= ST7735_HEIGHT) h = ST7735_HEIGHT - y;
    for(int i = x; i < (x + w); i++) {
        ucg_DrawPixel(ucg, i, y);
        ucg_DrawPixel(ucg, i, (y + h - 1));
    }

    for (int j = y; j < (y + h); j++) {
      ucg_DrawPixel(ucg, x, j);
      ucg_DrawPixel(ucg, (x + w - 1), j);
    }
}

/* void ucg_SetColor(ucg_t* ucg, uint8_t idx, uint16_t color) { */
/*     ucg->color[idx] = color; */
/* } */

inline void ucg_SetBackColor(ucg_t* ucg, uint16_t color) {
    ucg->backcolor = color;
}

inline void ucg_SetForeColor(ucg_t* ucg, uint16_t color) {
    ucg->forecolor = color;
}

uint16_t ucg_GetBackColor(ucg_t* ucg) {
    uint16_t color;
    color = ucg->backcolor;
    return color;
}

uint16_t ucg_GetForeColor(ucg_t* ucg) {
    uint16_t color;
    color = ucg->forecolor;
    return color;
}

inline void ucg_SetFont(ucg_t* ucg, const tFont* font) {
    ucg->font = font;
}

const tFont* ucg_GetFont(ucg_t *ucg) {
    const tFont *font;
    font = ucg->font;
    return font;
}

void ucg_DrawLine(ucg_t* ucg, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {
    uint16_t n, dx, dy, sgndx, sgndy, dxabs, dyabs, x, y, drawx, drawy;


    dx = x2 - x1;
    dy = y2 - y1;
    dxabs = (dx>0)?dx:-dx;
    dyabs = (dy>0)?dy:-dy;
    sgndx = (dx>0)?1:-1;
    sgndy = (dy>0)?1:-1;
    x = dyabs >> 1;
    y = dxabs >> 1;
    drawx = x1;
    drawy = y1;

    ucg_DrawPixel(ucg, drawx, drawy);

    if( dxabs >= dyabs )
    {
        for( n=0; n<dxabs; n++ )
        {
            y += dyabs;
            if( y >= dxabs )
            {
                y -= dxabs;
                drawy += sgndy;
            }
            drawx += sgndx;
            ucg_DrawPixel(ucg, drawx, drawy);
        }
    }
    else
    {
        for( n=0; n<dyabs; n++ )
        {
            x += dxabs;
            if( x >= dyabs )
            {
                x -= dyabs;
                drawx += sgndx;
            }
            drawy += sgndy;
            ucg_DrawPixel(ucg, drawx, drawy);
        }
    }  
}

/*    Arc 90 degress */
/*   Paramer s 0x03 0x0C 0x30 0xC0 */
/*   place arc */
void ucg_DrawArc(ucg_t* ucg, int16_t x0, int16_t y0, int16_t r, uint8_t s) {
   int16_t x,y,xd,yd,e;

   if ( x0<0 ) return;
   if ( y0<0 ) return;
   if ( r<=0 ) return;

   xd = 1 - (r << 1);
   yd = 0;
   e = 0;
   x = r;
   y = 0;

   while ( x >= y )
   {
      // Q1
      if ( s & 0x01 ) ucg_DrawPixel(ucg, x0 + x, y0 - y);
      if ( s & 0x02 ) ucg_DrawPixel(ucg, x0 + y, y0 - x);

      // Q2
      if ( s & 0x04 ) ucg_DrawPixel(ucg, x0 - y, y0 - x);
      if ( s & 0x08 ) ucg_DrawPixel(ucg, x0 - x, y0 - y);

      // Q3
      if ( s & 0x10 ) ucg_DrawPixel(ucg, x0 - x, y0 + y);
      if ( s & 0x20 ) ucg_DrawPixel(ucg, x0 - y, y0 + x);

