bagdades/stm32solderstation_st7735/Drivers/graphics/st7735.c
      // Q4
      if ( s & 0x40 ) ucg_DrawPixel(ucg, x0 + y, y0 + x);
      if ( s & 0x80 ) ucg_DrawPixel(ucg, x0 + x, y0 + y);

      y++;
      e += yd;
      yd += 2;
      if ( ((e << 1) + xd) > 0 )
      {
         x--;
         e += xd;
         xd += 2;
      }
   }
}
void ucg_DrawCircle(ucg_t* ucg, int16_t x0, int16_t y0, int16_t r) {
   int16_t x,y,xd,yd,e;

   if ( x0<0 ) return;
   if ( y0<0 ) return;
   if ( r<=0 ) return;

   xd = 1 - (r << 1);
   yd = 0;
   e = 0;
   x = r;
   y = 0;

   while ( x >= y )
   {
      ucg_DrawPixel(ucg, x0 - x, y0 + y);
      ucg_DrawPixel(ucg, x0 - x, y0 - y);
      ucg_DrawPixel(ucg, x0 + x, y0 + y);
      ucg_DrawPixel(ucg, x0 + x, y0 - y);
      ucg_DrawPixel(ucg, x0 - y, y0 + x);
      ucg_DrawPixel(ucg, x0 - y, y0 - x);
      ucg_DrawPixel(ucg, x0 + y, y0 + x);
      ucg_DrawPixel(ucg, x0 + y, y0 - x);

      y++;
      e += yd;
      yd += 2;
      if ( ((e << 1) + xd) > 0 )
      {
         x--;
         e += xd;
         xd += 2;
      }
   }
}

void ucg_DrawRBox(ucg_t *ucg, int16_t x, int16_t y, int16_t w, int16_t h, int16_t r) {
   int16_t x1 = x + w - 1;
   int16_t y1 = y + h - 1;

   if ( r > x1 ) return;
   if ( r > y1 ) return;

   ucg_DrawLine(ucg, x+r, y, x1-r, y);
   ucg_DrawLine(ucg, x+r, y1, x1-r, y1);
   /* ucg_DrawLine(ucg, x, y+r, x, y1-r); */
   /* ucg_DrawLine(ucg, x1, y+r, x1, y1-r); */
   ucg_DrawArc(ucg, x+r, y+r, r, 0x0C);
   ucg_DrawArc(ucg, x1-r, y+r, r, 0x03);
   ucg_DrawArc(ucg, x+r, y1-r, r, 0x30);
   ucg_DrawArc(ucg, x1-r, y1-r, r, 0xC0);
}

void ucg_DrawRoundFrame(ucg_t* ucg, int16_t x1, int16_t y1, int16_t x2, int16_t y2, int16_t r) {
   int16_t n;
   if ( x2 < x1 )
   {
      n = x2;
      x2 = x1;
      x1 = n;
   }
   if ( y2 < y1 )
   {
      n = y2;
      y2 = y1;
      y1 = n;
   }

   if ( r > x2 ) return;
   if ( r > y2 ) return;

   ucg_DrawLine(ucg, x1+r, y1, x2-r, y1);
   ucg_DrawLine(ucg, x1+r, y2, x2-r, y2);
   ucg_DrawLine(ucg, x1, y1+r, x1, y2-r);
   ucg_DrawLine(ucg, x2, y1+r, x2, y2-r);
   ucg_DrawArc(ucg, x1+r, y1+r, r, 0x0C);
   ucg_DrawArc(ucg, x2-r, y1+r, r, 0x03);
   ucg_DrawArc(ucg, x1+r, y2-r, r, 0x30);
   ucg_DrawArc(ucg, x2-r, y2-r, r, 0xC0);
}

void ucg_DrawImage(uint16_t x, uint16_t y, uint16_t w, uint16_t h, const uint16_t* data) {
    if((x >= ST7735_WIDTH) || (y >= ST7735_HEIGHT)) return;
    if((x + w - 1) >= ST7735_WIDTH) return;
    if((y + h - 1) >= ST7735_HEIGHT) return;

    ST7735_Select();
    ST7735_SetAddressWindow(x, y, x+w-1, y+h-1);
    ST7735_WriteData((uint8_t*)data, sizeof(uint16_t)*w*h);
    ST7735_Unselect();
}

inline uint16_t ucg_GetYDim(ucg_t *ucg) {
    return ucg->y_dim;
}

inline uint16_t ucg_GetXDim(ucg_t *ucg) {
    return ucg->x_dim;
}

//Return width in pixel include distance beetween chars
uint8_t ucg_GetStrWidth(ucg_t *ucg, const tFont* font, const char *str) {
    uint8_t w = 0;
    uint8_t chr;
    if(font->chars[0].code != ' ') {
        chr = *str - '0';
        /* return 0; */
    }
    else chr = *str - font->chars[0].code;
    while (*str) {
        w += font->chars[chr].image->width;
        /* w += 1; */
        str++;
    }
    /* w -= 1; */
    return w;
}

void ucg_InvertColors(bool invert) {
    ST7735_Select();
    ST7735_WriteCommand(invert ? ST7735_INVON : ST7735_INVOFF);
    ST7735_Unselect();
}

void ucg_DrawBmp(uint16_t x, uint16_t y, const tImage* img, uint16_t color, uint16_t bgcolor) {
    uint16_t b;
    uint8_t n;
    uint16_t m;
    n = 0;
    m = 0;
    if((x >= ST7735_WIDTH) || (y >= ST7735_HEIGHT)) return;
    if((x + img->width - 1) >= ST7735_WIDTH) return;
    if((y + img->height - 1) >= ST7735_HEIGHT) return;

    ST7735_Select();
    ST7735_SetAddressWindow(x, y, x+img->width - 1, y+img->height - 1);
    b = img->data[m++];
    for (uint8_t i = 0; i < img->height; i++) {
        for (uint8_t j = 0; j < img->width; j++) {
            if(b & 0x8000)  {
                uint8_t data[] = { color >> 8, color & 0xFF };
                ST7735_WriteData(data, sizeof(data));
            } else {
                uint8_t data[] = { bgcolor >> 8, bgcolor & 0xFF };
                ST7735_WriteData(data, sizeof(data));
            }
            n++;
            b = b << 1;
            if(n == 16) {
                n = 0;
                b = img->data[m++];
            }
        }
    }
    ST7735_Unselect();
}

void Reset_onError(void){
  __disable_irq();
  while(BUTTON_input()){                    // Wait until the button is pressed
    for(uint16_t i=0;i<50000;i++);          // Small delay
    /* HAL_IWDG_Refresh(&hiwdg);               // Clear watchdog */
  }
  while(!BUTTON_input()){                   // Wait until the button is released
    for(uint16_t i=0;i<50000;i++);          // Small delay
    /* HAL_IWDG_Refresh(&hiwdg);               // Clear watchdog */
  }
  NVIC_SystemReset();                       // Reset system
}

void FatalError(uint8_t type){
    /* uint8_t lang =systemSettings.settings.language; */
    /* if(lang>(LANGUAGE_COUNT-1)){ */
    /*     lang=lang_english; */
    /* } */

    setSafeMode(enable);
    /* buzzer_fatal_beep(); */
    Oled_error_init();
    switch(type){
        case error_FLASH:
            ucg_WriteString(&ucg, 1, 1, "FLASH ERROR");
            break;
        case error_NMI:
            ucg_WriteString(&ucg, 1, 1, "NMI HANDLER");
            break;
            break;
        case error_HARDFAULT:
            ucg_WriteString(&ucg, 1, 1, "HARD FAULT");
            break;
            break;
        case error_MEMMANAGE:
            ucg_WriteString(&ucg, 1, 1, "MEM MANAGE");
            break;
            break;
        case error_BUSFAULT:
            ucg_WriteString(&ucg, 1, 1, "BUS FAULT");
            break;
            break;
        case error_USAGEFAULT:
            ucg_WriteString(&ucg, 1, 1, "USAGE FAULT");
            break;
            break;
        case error_RUNAWAY25:
        case error_RUNAWAY50:
        case error_RUNAWAY75:
        case error_RUNAWAY100:
            {
                uint8_t level = 25 * ((type - error_RUNAWAY25)+1);
                char strRunawayLevel[8];
                sprintf(strRunawayLevel,">%u\n",level);
                ucg_WriteString(&ucg, 1, 1, strings[0].ERROR_RUNAWAY);
                ucg_WriteString(&ucg, 1, 15, strRunawayLevel);
                break;
            }
        case error_RUNAWAY500:
            ucg_WriteString(&ucg, 1, 1, strings[0].ERROR_EXCEEDED);
            ucg_WriteString(&ucg, 1, 15, "500 C!");
            break;

        default:
            ucg_WriteString(&ucg, 1, 1, strings[0].ERROR_UNKNOWN);
            break;
    }
    ucg_WriteString(&ucg, 1, 1, strings[0].ERROR_SYSTEM_HALTED);
    ucg_WriteString(&ucg, 1, 1, strings[0].ERROR_BTN_RESET);

    Reset_onError();
}
